#  1] Importing Libraries

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
# %matplotlib inline

# 2] Loading dataset into pandas dataframe src='https://www.kaggle.com/datasets/nehalbirla/vehicle-dataset-from-cardekho?select=car+data.csv'

In [2]:

# 
df=pd.read_csv('car_data.csv')

In [3]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [4]:
df.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

# make some manual changes in csv file to create some missing values,outliers and inconsisitency

In [5]:
df=pd.read_csv('car_data_dirty.csv')

In [6]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,NaN,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

# 1]check for null

In [7]:
df.isnull().sum()

Car_Name          0
Year              0
Selling_Price    10
Present_Price     7
Kms_Driven        0
Fuel_Type         0
Seller_Type       0
Transmission      0
Owner             0
dtype: int64

In [8]:
df.describe()

              Year  Selling_Price  Present_Price     Kms_Driven       Owner
count   301.000000     291.000000     294.000000     301.000000  301.000000
mean   2013.627907       4.619381       7.656939   36947.205980    0.043189
std       2.891554       4.854594       8.694280   38886.883882    0.247915
min    2003.000000       0.100000       0.320000     500.000000    0.000000
25%    2012.000000       0.900000       1.295000   15000.000000    0.000000
50%    2014.000000       3.750000       6.445000   32000.000000    0.000000
75%    2016.000000       6.000000       9.900000   48767.000000    0.000000
max    2018.000000      35.000000      92.600000  500000.000000    3.000000

In [9]:
df.shape

(301, 9)

In [10]:
x_=df.columns

In [11]:
x_

Index(['Car_Name', 'Year', 'Selling_Price', 'Present_Price', 'Kms_Driven',
       'Fuel_Type', 'Seller_Type', 'Transmission', 'Owner'],
      dtype='object')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  291 non-null    float64
 3   Present_Price  294 non-null    float64
 4   Kms_Driven     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Seller_Type    301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.3+ KB

# filling null values with mean

In [13]:
# find cols with null values

In [14]:
print(" varaibles\t\t data type \t\tno of null values")
print("------------------------------------------------------------")
for col in x_:
        
        print(f"{col }\t\t {df[col].dtypes }\t\t{df[col].isnull().sum()}")

 varaibles		 data type 		no of null values
------------------------------------------------------------
Car_Name		 object		0
Year		 int64		0
Selling_Price		 float64		10
Present_Price		 float64		7
Kms_Driven		 int64		0
Fuel_Type		 object		0
Seller_Type		 object		0
Transmission		 object		0
Owner		 int64		0

In [15]:
# fill null values using mean in 2 cols

In [16]:
df['Selling_Price']=df['Selling_Price'].replace(np.NaN,df['Selling_Price'].mean())

In [17]:
df['Present_Price']=df['Present_Price'].replace(np.NaN,df['Present_Price'].mean())

In [18]:
df.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

In [19]:
# hence null values removed

# 2 check for wrong data

In [20]:
for col in x_:
    if(df[col].dtypes=='object'):
        print(col, df[col].unique(),"\n--------------------------")

Car_Name ['ritz' 'sx4' 'ciaz' 'wagon r' 'swift' 'vitara brezza' 's cross'
 'alto 800' 'ertiga' 'dzire' 'alto k10' 'ignis' '800' 'baleno' 'omni'
 'fortuner' 'innova' 'corolla altis' 'etios cross' 'etios g' 'etios liva'
 'corolla' 'etios gd' 'camry' 'land cruiser' 'Royal Enfield Thunder 500'
 'UM Renegade Mojave' 'KTM RC200' 'Bajaj Dominar 400'
 'Royal Enfield Classic 350' 'KTM RC390' 'Hyosung GT250R'
 'Royal Enfield Thunder 350' 'KTM 390 Duke ' 'Mahindra Mojo XT300'
 'Bajaj Pulsar RS200' 'Royal Enfield Bullet 350'
 'Royal Enfield Classic 500' 'Bajaj Avenger 220' 'Bajaj Avenger 150'
 'Honda CB Hornet 160R' 'Yamaha FZ S V 2.0' 'Yamaha FZ 16'
 'TVS Apache RTR 160' 'Bajaj Pulsar 150' 'Honda CBR 150' 'Hero Extreme'
 'Bajaj Avenger 220 dtsi' 'Bajaj Avenger 150 street' 'Yamaha FZ  v 2.0'
 'Bajaj Pulsar  NS 200' 'Bajaj Pulsar 220 F' 'TVS Apache RTR 180'
 'Hero Passion X pro' 'Bajaj Pulsar NS 200' 'Yamaha Fazer '
 'Honda Activa 4G' 'TVS Sport ' 'Honda Dream Yuga '
 'Bajaj Avenger Street 220' 'Hero Splender iSmart' 'Activa 3g'
 'Hero Passion Pro' 'Honda CB Trigger' 'Yamaha FZ S '
 'Bajaj Pulsar 135 LS' 'Activa 4g' 'Honda CB Unicorn'
 'Hero Honda CBZ extreme' 'Honda Karizma' 'Honda Activa 125' 'TVS Jupyter'
 'Hero Honda Passion Pro' 'Hero Splender Plus' 'Honda CB Shine'
 'Bajaj Discover 100' 'Suzuki Access 125' 'TVS Wego' 'Honda CB twister'
 'Hero Glamour' 'Hero Super Splendor' 'Bajaj Discover 125' 'Hero Hunk'
 'Hero  Ignitor Disc' 'Hero  CBZ Xtreme' 'Bajaj  ct 100' 'i20' 'grand i10'
 'i10' 'eon' 'xcent' 'elantra' 'creta' 'verna' 'city' 'brio' 'amaze'
 'jazz']
--------------------------
Fuel_Type ['Petrol' 'Diesel' 'CNG' '45' '66' '77' '32' '11']
--------------------------
Seller_Type ['Dealer' 'Individual']
--------------------------
Transmission ['Manual' 'Automatic']
--------------------------

In [21]:
# as we can see there is wrong data in Fuel_type col

In [22]:
a=['Petrol','Diesel']
df = df[df['Fuel_Type'].isin(a)]

In [23]:
df['Fuel_Type'].unique()

array(['Petrol', 'Diesel'], dtype=object)

In [24]:
df.Fuel_Type.mode()

0    Petrol
dtype: object

In [25]:

df.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

# Turn categorical variables into quantitative variables in Python

In [26]:
for col in x_[1:]:
    if(df[col].dtypes=='object'):
        print(col, df[col].unique(),"\n--------------------------")

Fuel_Type ['Petrol' 'Diesel']
--------------------------
Seller_Type ['Dealer' 'Individual']
--------------------------
Transmission ['Manual' 'Automatic']
--------------------------

In [27]:
# 1st way

In [28]:
df['Fuel_Type'].replace(['Petrol', 'Diesel'],
                        [0, 1], inplace=True)

In [29]:
df.Fuel_Type.unique()

array([0, 1], dtype=int64)

In [31]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,7.656939,27000,0,Dealer,Manual,0
1,sx4,2013,4.75,9.540000,43000,1,Dealer,Manual,0
2,ciaz,2017,7.25,9.850000,6900,0,Dealer,Manual,0
3,wagon r,2011,2.85,4.150000,5200,0,Dealer,Manual,0
4,swift,2014,4.60,6.870000,42450,1,Dealer,Manual,0

In [30]:
# 2nd way

In [32]:
dummies = pd.get_dummies(df.Transmission)

df= pd.concat([df, dummies], axis='columns')
 
# drop the values
df.drop(['Manual','Transmission'], axis='columns')
 
# print the dataframe

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Owner,Automatic
0,ritz,2014,3.350000,7.656939,27000,0,Dealer,0,0
1,sx4,2013,4.750000,9.540000,43000,1,Dealer,0,0
2,ciaz,2017,7.250000,9.850000,6900,0,Dealer,0,0
3,wagon r,2011,2.850000,4.150000,5200,0,Dealer,0,0
4,swift,2014,4.600000,6.870000,42450,1,Dealer,0,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.500000,11.600000,33988,1,Dealer,0,0
297,brio,2015,4.000000,5.900000,60000,0,Dealer,0,0
298,city,2009,4.619381,11.000000,87934,0,Dealer,0,0
299,city,2017,11.500000,12.500000,9000,1,Dealer,0,0
300,brio,2016,5.300000,5.900000,5464,0,Dealer,0,0

In [33]:
df.Automatic.unique()

array([0, 1], dtype=uint8)